<template>
  <div class="flex flex-col md:flex-row gap-6">
    <div class="md:w-1/4 font-bold text-4xl">
      Вопросы и ответы
    </div>
    <div class="md:w-3/4 flex flex-col gap-10">
      <QuestionsItem v-for="question in questions" :key="question.title" :question="question" />
    </div>
  </div>
</template>

<script setup lang="ts">
import QuestionsItem from './QuestionsItem.vue'

const questions = [
  {
    title: 'Какая цель у нашего сайта?',
    answer: 'Целью данного сайта является предоставление прогноза счетов за коммунальные услуги, основанного на объеме инвестиций в ремонт и техническое обслуживание зданий и сооружений.'
  },
  {
    title: 'Какие технологии мы используем?',
    answer: 'Мы используем широкий спектр технологий - машинное обучение, PYTHON, градиентный бустинг, catboost и пр.'
  },
  {
    title: 'Как этот веб-сайт рассчитывает прогноз счетов за коммунальные услуги?',
    answer: 'Этот сайт использует передовые алгоритмы и методы анализа данных для расчета прогноза счетов за коммунальные услуги. В нем учитывается объем инвестиций в ремонт и техническое обслуживание зданий и сооружений, а также другие соответствующие факторы.'
  },
  {
    title: 'Могу ли я доверять точности прогноза, предоставленного этим веб-сайтом?',
    answer: 'Хотя мы стремимся предоставлять точные прогнозы, пожалуйста, обратите внимание, что фактические счета за коммунальные услуги могут отличаться из-за к различным факторам, находящимся вне нашего контроля. Однако наши алгоритмы разработаны для предоставления надежных оценок на основе доступных данных.'
  },
]
</script>